app/Models/Erp/ErpCompanyInformationModel.php

SELECT `company_name`
FROM `erp_companyinfo`
---
    public function company_name(){
        return $this->builder()->select('company_name')->get()->getRow();