app/Models/Erp/NotificationModel.php

    public function getNotifyForUser($user_id)
    {
        // $thequery = "select * from notification where status = 0 and user_id =".$user_id;
        // return $this->db->query($thequery)->getResultArray();

        return $this->builder()->select('notification.* , erp_users.name, erp_users.last_name')
            ->where('notification.status', 0)
            ->where('notification.user_id', $user_id)->join("erp_users", "notification.created_by = erp_users.user_id")->orderBy('created_at', 'DESC')
            ->limit(3)->get()->getResultArray();
---
SELECT `notification`.*, `erp_users`.`name`, `erp_users`.`last_name`
FROM `notification`
JOIN `erp_users` ON `notification`.`created_by` = `erp_users`.`user_id`
WHERE `notification`.`status` = 0
AND `notification`.`user_id` = '1'
ORDER BY `created_at` DESC
 LIMIT 3