app/Models/Erp/TimesheetModel.php

SELECT *
FROM `timesheet`
WHERE `assigned_to` = '1'
AND `end_timer` = '0000-00-00 00:00:00'
---
    public function find_running_timer($assigned_to)
    {
        $result = $this->builder()
            ->where("assigned_to", $assigned_to)
            ->where("end_timer", '0000-00-00 00:00:00')
            ->get()
            ->getRow();