app/Models/Erp/MRP/BOMItemsModel.php

SELECT *
FROM `bom_items`
WHERE `bom_id` = '45'
---
    public function get_bom_items($bom_id){
        $result  = $this->builder()->where("bom_id",$bom_id)->get()->getResultArray();