app/Models/Erp/MRP/BomOperationModel.php

SELECT `bom_operation_list`.`id` as `id`, `bom_operation_list`.`operation_id` as `op_id`, `bom_operation`.`name` as `op_name`, `workstation`.`name` as `w_name`, `bom_operation_list`.`per_hour_cost` as `per_cost`, `bom_operation_list`.`opertaion_time` as `op_time`, `bom_operation_list`.`amount` as `amount`
FROM `bom_operation_list`
JOIN `bom_operation` ON `bom_operation`.`id` = `bom_operation_list`.`operation_id`
JOIN `workstation` ON `workstation`.`id` = `bom_operation`.`default_workstation_id`
WHERE `bom_id` = '45'
---
    public function get_bom_operation_items($bom_id){
        $result  = $this->table("bom_operation_list")->select("bom_operation_list.id as id,bom_operation_list.operation_id as op_id,bom_operation.name as op_name,workstation.name as w_name,bom_operation_list.per_hour_cost as per_cost,bom_operation_list.opertaion_time as op_time,bom_operation_list.amount as amount")->join("bom_operation","bom_operation.id = bom_operation_list.operation_id")->join("workstation","workstation.id = bom_operation.default_workstation_id")->where("bom_id",$bom_id)->get()->getResultArray();