app/Models/Erp/MRP/BomscrapitemsModel.php

    public function get_bom_scrap_items($bom_id)
    {
        $result = $this->builder()->where("bom_id", $bom_id)->get()->getResultArray();
---
SELECT *
FROM `bom_scrap_items`
WHERE `bom_id` = '45'