app/Models/Erp/MRP/CostingModel.php

SELECT *
FROM `costing`
WHERE `planning_id` = '1'
---
    public function getCostingData($planning_id)
    {
        return $this->builder()->select('*')->where('planning_id', $planning_id)->get()->getRow();

SELECT `operation_per_unit_cost`
FROM `bom`
WHERE `bom_id` = '45'
AND `related_id` = '1'
SELECT `amount`
FROM `bom_operation_list`
WHERE `bom_id` = '45'
---
    public function getOperationCost($planning_id, $bom_id){
        $result_1 = $this->db->table('bom')->select('operation_per_unit_cost')
            ->where('bom_id', $bom_id)->where('related_id',$planning_id)->get()->getRowArray()['operation_per_unit_cost'];

        if($result_1 && $result_1 != 0 || $result_1 != '0'){
            return $result_1;
        }else{
            $result_2 = $this->db->table('bom_operation_list')->select('amount')->where('bom_id',$bom_id)
                        ->get()->getResultArray();