app/Models/Erp/MRP/PlanningModel.php

    public function get_finishedgood_id($planning_id)
    {
        return $this->builder()->where("planning_id", $planning_id)->get()->getRowArray();
---
SELECT *
FROM `planning`
WHERE `planning_id` = '1'